app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`content`, `created_at`, `name`, `title`, `updated_at`) VALUES (NULL, '2011-11-02 19:58:14', NULL, NULL, '2011-11-02 19:58:14')

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
UPDATE `posts` SET `content` = 'hello123456789', `updated_at` = '2011-11-02 21:59:30', `title` = 'hello' WHERE `posts`.`id` = 1